<!DOCTYPE html>
<html>
    <head>
        <?php include "layout/head.php" ?>
    </head>
    <body>
        <?php include "layout/nav.php" ?>
        <div id="wrapper">
            <section class="member">
                <?php include "layout/nav-member.php" ?>
                <div class="member-body">
                    <a href="javascript:history.back()" class="to-back font-blue hidden-desktop">
                        <div class="text-icon is-middle">
                            <i class="glyphicon glyphicon-menu-left" style="top: 56%"></i>
                            <span>กลับไปเมนูบัญชีทั่วไป</span>
                        </div>
                    </a>
                    <form action="member-business.php" method="post" enctype="multipart/form-data">
                        <div class="step-footer">
                            <div class="text">
                                <div class="symbol">
                                    <i class="m-icon m-icon-heart"></i>
                                </div>
                                <div class="progress">
                                    <div class="progress-bar progress-bar-danger" role="progressbar" aria-valuenow="0" aria-valuemin="0" aria-valuemax="100" style="width: 50%;">
                                        <span class="sr-only"></span>
                                    </div>
                                </div>
                                <div class="step">
                                    <i class="m-icon m-icon-heart active"></i>
                                    <i class="m-icon m-icon-heart active"></i>
                                    <i class="m-icon m-icon-heart"></i>
                                    <i class="m-icon m-icon-heart"></i>
                                </div>
                            </div>
                            <button type="submit" class="btn btn-md btn-blue-linear btn-save">บันทึกและส่งข้อมูล</button>
                        </div>
                        <h2 class="font-semibold no-margin">เพิ่มข้อมูลธุรกิจกลุ่มไมซ์</h2>
                        <p>หากท่านมีธุรกิจที่ต้องการที่เกี่ยวข้องกับอุตสาหกรรมไมซ์ และต้องการจะเข้าร่วมธุรกิจกับเรา สามารถกรอกรายละเอียดข้อมูลของท่าน และรอการดำเนินการจากแอดมินระบบภายใน 3-5 วันทำการ โดยไม่มีค่าใช้จ่ายใดๆ เพิ่มเติม</p>
                        <br/>
                        <div class="panel panel-default">
                            <div class="panel-heading">
                                <h3 class="font-semibold no-margin">เลือกประเภทกลุ่มธุรกิจของท่าน</h3>
                            </div>
                            <?php
                                $data = array();

                                $data[0] = array();
                                $data[0]['name'] = 'สถานที่จัดงาน';
                                $data[0]['img'] = 'assets/images/mice1.png';
                                $data[0]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('โรงแรมและรีสอร์ทที่มีสถานที่จัดงาน', 'กลุ่มโรงแรมและรีสอร์ทที่มีสถานที่จัดกิจกรรมไมซ์ โดยกลุ่มนี้จะแบ่งกลุ่มย่อยตามสถานที่ที่ใช้ในการจัดกิจกรรมไมซ์หลัก เช่น ห้อง Boardroom ห้อง Meeting Room ห้อง Auditorium และสถานที่จัดงาน (Event Space)'),
                                            array('ศูนย์แสดงสินค้า','กลุ่มสถานที่จัดกิจกรรมไมซ์แสดงประเภทศูนย์แสดงสินค้า'),
                                            array('ศูนย์ประชุม','กลุ่มสถานที่จัดกิจกรรมไมซ์ประเภทศูนย์ประชุม โดยครอบคลุมถึงศูนย์ประชุมโดยเฉพาะที่ไม่ได้รวมอยู่ในโรงแรม โดยจะเน้นกลุ่มเป้าหมายไปที่สถานที่จัดกิจกรรมประชุมวิชาการ โดยปกติแล้วการประชุมประเภท Conference Center จะมีขนาดเล็กกว่าประเภท Convention Center โดยศูนย์ประชุมประเภท Convention Center จะสามารถรองรับกิจกรรมได้หลากหลายกว่าศูนย์ประชุมประเภท Conference Center'),
                                            array('สถานที่ราชการ','กลุ่มสถานที่จัดกิจกรรมประเภทไมซ์ที่เป็นสถานที่ราชการ'),
                                            array('สถาบันการศึกษา','กลุ่มสถานที่จัดกิจกรรมประเภทไมซ์ที่เป็นสถาบันการศึกษา'),
                                            array('สถานที่นั่งทำงานร่วมกัน','เป็นสถานที่การจัดงานแนวใหม่ซึ่งสามารถแบ่งส่วนของห้องประชุม และสถานที่จัดงาน (Event Space)'),
                                            array('สถานที่จัดงานพิเศษ','กลุ่มสถานที่จัดงานพิเศษ เช่น สนามกีฬา โรงละคร ห้องสมุด หอศิลป์ พิพิธภัณฑ์')
                                        )
                                    )
                                );

                                $data[1] = array();
                                $data[1]['name'] = 'ออแกไนเซอร์';
                                $data[1]['img'] = 'assets/images/mice2.png';
                                $data[1]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('วางแผนการประชุม','ธุรกิจที่เชี่ยวชาญด้านการวางแผนประชุม'),
                                            array('วางแผนการเดินทางสำหรับองค์กร เดินทางเพื่อเป็นรางวัล','ธุรกิจที่เชี่ยวชาญในการวางแผนการเดินทางสำหรับองค์กร การเดินทางเพื่อเป็นรางวัล'),
                                            array('จัดงานประชุมสัมมนา','บริษัทให้บริการจัดการประชุมนานาชาติสำหรับสมาคมวิชาชีพต่างๆ'),
                                            array('จัดงานแสดงสินค้า','บริษัทให้บริการจัดงานแสดงสินค้านานาชาติ ผู้ที่ทำหน้าที่บริหารงาน ทำการขายพื้นที่แสดงงาน (บูธ) ทำการตลาดเพื่อชักชวนผู้ประกอบการมาออกบูธเพื่อแสดงสินค้า (Exhibitor) และเชิญชวนผู้ซื้อมาชมงาน (Visitor)'),
                                            array('วางแผนการเดินทางสำหรับองค์กร','ธุรกิจที่เชี่ยวชาญในการวางแผนการเดินทางสำหรับองค์กร'),
                                            array('จัดงานอีเวนต์','ธุรกิจที่เชี่ยวชาญในการจัดงานอีเวนต์'),
                                            array('อีเว้นท์แมเนจเมนท์ ','ธุรกิจบริการจัดงาน ซึ่งครอบคลุม การจัดงานหลากหลายประเภท ได้แก่ ธุรกิจจัดประชุมสัมมนา จัดประกวด การจัดงานแสดงสินค้า จัดกิจกรรมพิเศษ และจัดงานสังสรรค์รวมไปถึงรับจ้างก่อสร้างตกแต่งสถานที่และรับงาน ประชาสัมพันธ์ให้บริการระบบแสงสีเสียง การแสดงบนเวที การจัดคอนเสริต จัดฉายภาพยนตร์'),
                                            array('จัดงานประเภท CSR หรือ Team Building','ธุรกิจที่เชี่ยวชาญในการรับจัดงานประเภท CSR หรือการพัฒนาทรัพยากรมนุษย์ให้กับองค์กร'),
                                            array('จัดการการท่องเที่ยวสำหรับองค์กร','ธุรกิจจัดการการท่องเที่ยวสำหรับองค์กร')
                                        )
                                    )
                                );

                                $data[2] = array();
                                $data[2]['name'] = 'บริการสำหรับผู้จัดงาน';
                                $data[2]['img'] = 'assets/images/mice3.png';
                                $data[2]['checkbox'] = array(
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-บริการด้านการตลาด',
                                        'subgroup' => array(
                                            array('ขายบัตรและการดูแลลูกค้า','ธุรกิจด้านการขายบัตรและการดูแลลูกค้า'),
                                            array('โฆษณาและประชาสัมพันธ์','ธุรกิจด้านการโฆษณาและประชาสัมพันธ์'),
                                            array('ที่ปรึกษาทางการตลาด','ธุรกิจด้านที่ปรึกษาทางการตลาด'),
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-ผู้รับเหมา',
                                        'subgroup' => array(
                                            array('ออกแบบและก่อสร้างบูธ','ธุรกิจที่ให้บริการออกแบบและก่อสร้างบูธ เช่น บูธสำหรับงานแสดงสินค้า หรือการเปิดตัวสินค้า'),
                                            array('ออกแบบและก่อสร้างเวที','ธุรกิจที่ให้บริการออกแบบและก่อสร้างเวที ไม่ว่าจะเป็นสำหรับการจัดประชุมวิชาการ การจัดสัมมนา หรือการจัด Mega Event'),
                                            array('ปูพื้นหรือพรมสำหรับในสถานที่จัดงาน','ธุรกิจที่ให้บริการด้านการปูพื้นหรือพรมสำหรับในสถานที่จัดงานประชุม'),
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-รักษาความปลอดภัย',
                                        'subgroup' => array(
                                            array('รักษาความปลอดภัย','ธุรกิจการให้บริการด้านการรักษาความปลอดภัย เช่น การให้บริการ รปภ. ในงานแสดงสินค้า'),
                                            array('ให้บริการอุปกรณ์ที่เกี่ยวข้องกับการรักษาความปลอดภัย','ธุรกิจการให้บริการอุปกรณ์ที่เกี่ยวข้องกับการรักษาความปลอดภัย เช่น การให้เช่าเครื่องตรวจจับโลหะ ระบบกล้องวงจรปิด สำหรับกิจกรรมไมซ์'),
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-ทำความสะอาด เก็บขยะ',
                                        'subgroup' => array(
                                            array('ทำความสะอาดทั่วไป','ธุรกิจที่ให้บริการด้านการทำความสะอาดทั่วไป เช่น แม่บ้านเก็บขยะในงานแสดงสินค้า'),
                                            array('ทำความสะอาดในพื้นที่ภายนอก','ธุรกิจที่ให้บริการด้านการทำความสะอาดในพื้นที่ภายนอก เช่น แม่บ้านหรือพนักงานที่คอยดูแลความสะอาดในสวน'),
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-สื่อโสตทัศน์',
                                        'subgroup' => array(
                                            array('บริการด้านระบบ และอุปกรณ์สื่อโสตทัศน์','ธุรกิจที่ให้บริการด้านระบบ และอุปกรณ์สื่อโสตทัศน์สำหรับการจัดกิจกรรมไมซ์ รวมถึงการให้บริการช่างเทคนิคทางด้านโสตทัศน์'),
                                            array('บริการการผลิตสื่อโสตทัศน์','ธุรกิจที่ให้บริการการผลิตสื่อโสตทัศน์สำหรับการจัดกิจกรรมไมซ์ เช่น VTR สำหรับการเปิดตัวผลิตภัณฑ์')
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-บริการด้านระบบไฟฟ้า',
                                        'subgroup' => array(
                                            array('ระบบไฟฟ้า และอุปกรณ์ไฟฟ้า','ธุรกิจที่ให้บริการด้านระบบไฟฟ้า และอุปกรณ์ไฟฟ้าสำหรับการจัดกิจกรรมไมซ์ รวมถึงการให้บริการช่างไฟฟ้า'),
                                            array('แสงสว่าง และการจัดแสงสี','ธุรกิจที่ให้บริการด้านแสงสว่าง และการจัดแสงสีสำหรับกิจกรรมไมซ์'),
                                            array('ตู้ไฟฟ้าสนามสำหรับงานอีเวนต์', 'ธุรกิจที่ให้บริการด้านตู้ไฟฟ้าสนามสำหรับงานอีเวนต์ เช่น เครื่องกำเนิดไฟฟ้าสำรอง')
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-บริการด้านสุขา',
                                        'subgroup' => array(
                                            array('บริการด้านตู้สุขา','ธุรกิจที่ให้บริการด้านตู้สุขา'),
                                            array('บริการด้านรถสุขา','ธุรกิจที่ให้บริการด้านรถสุขา')
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-ถ่ายภาพ และถ่ายวีดีโอ เลือกได้มากกว่า 1 ลักษณะธุรกิจ',
                                        'subgroup' => array(
                                            array('ถ่ายภาพ','ธุรกิจที่ให้บริการด้านการถ่ายภาพ'),
                                            array('วีดีโอ','ธุรกิจที่ให้บริการด้านวีดีโอ')
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-ถ่ายภาพ และถ่ายวีดีโอ',
                                        'subgroup' => array(
                                            array('ถ่ายเอกสาร','ธุรกิจที่ให้บริการด้านการถ่ายเอกสาร'),
                                            array('พิมพ์ดิจิตอล','ธุรกิจที่ให้บริการด้านการพิมพ์ดิจิตอล'),
                                            array('ทำป้าย','ธุรกิจที่ให้บริการด้านการทำป้าย เช่น ป้ายไวนิล'),
                                            array('การพิมพ์ขนาดใหญ่','ธุรกิจที่ให้บริการด้านการพิมพ์ ขนาดใหญ่ เช่น ป้ายสำหรับเวที สำหรับตกแต่งบูธ')
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-ล่ามและการแปลภาษา',
                                        'subgroup' => array(
                                            array('อุปกรณ์การแปลภาษา','ธุรกิจที่ให้บริการด้านอุปกรณ์การแปลภาษา เช่น หูฟังแปลภาษา ตู้ล่าม'),
                                            array('ล่าม','ธุรกิจที่ให้บริการด้านล่ามสำหรับกิจกรรมไมซ์'),
                                            array('แปลเอกสาร','ธุรกิจที่ให้บริการด้านการแปลเอกสาร')
                                        ),
                                    ),
                                    array(
                                        'group' => 'อุปกรณ์และบริการสำหรับการจัดงาน-ตัวแทนจัดหางาน มหาวิทยาลัย และอาชีวศึกษา',
                                        'subgroup' => array(
                                            array('จัดหาพนักงาน/เจ้าหน้าที่','หน่วยงานที่สามารถจัดหาพนักงาน/เจ้าหน้าที่สำหรับกิจกรรมไมซ์'),
                                            array('จัดหาอาสาสมัคร','หน่วยงานที่สามารถจัดหาอาสาสมัครสำหรับกิจกรรมไมซ์')
                                        ),
                                    )
                                );

                                $data[3] = array();
                                $data[3]['name'] = ' ท่องเที่ยว/การนำเที่ยว';
                                $data[3]['img'] = 'assets/images/mice4.png';
                                $data[3]['checkbox'] = array(
                                    array(
                                        'group' => 'ธุรกิจท่องเที่ยว-ธุรกิจนำเที่ยว',
                                        'subgroup' => array(
                                            array('ตัวแทนท่องเที่ยว','ธุรกิจที่นำรายการท่องเที่ยวจากบริษัทธุรกิจจัดนำเที่ยว (Tour Operator) มาขาย และได้รับนายหน้าตอบแทน'),
                                            array('จัดนำเที่ยว','ธุรกิจที่ผลิตรายการนำเที่ยว หรือ Package Tour ซึ่งสามารถวางแผนกิจกรรมการท่องเที่ยวให้สำหรับองค์กร และนักท่องเที่ยวประเภทไมซ์')
                                        )
                                    ),
                                    array(
                                        'group' => 'ธุรกิจท่องเที่ยว-แหล่งท่องเที่ยวและกิจกรรมท่องเที่ยว',
                                        'subgroup' => array(
                                            array('กลุ่มประวัติศาสตร์และวัฒนธรรม',''),
                                            array('การผจญภัย',''),
                                            array('การสร้างทีมเวิร์ค',''),
                                            array('กิจกรรม CSR และการประชุมเชิงอนุรักษ์',''),
                                            array('กิจกรรมบรรยากาศชายหาด',''),
                                            array('การจัดงานและกิจกรรมหรูหรามีระดับ',''),
                                            array('กิจกรรมนำเสนออาหารไทยในทุกการจัดงานที่หลากหลาย','')
                                        )
                                    )
                                );

                                $data[4] = array();
                                $data[4]['name'] = 'ที่พัก';
                                $data[4]['img'] = 'assets/images/mice5.png';
                                $data[4]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('โรงแรม', 'ธุรกิจให้บริการที่พัก อาหาร และสิ่งอำนวยความสะดวกพื้นฐาน'),
                                            array('รีสอร์ท','ธุรกิจให้บริการที่พัก อาหาร และสิ่งอำนวยความสะดวกพื้นฐาน มีสถานที่พักผ่อนที่มีความสะดวกสบายผ่อนคลาย และมีกิจกรรมภายในสถานที่')
                                        )
                                    )
                                );

                                $data[5] = array();
                                $data[5]['name'] = 'วิทยากร';
                                $data[5]['img'] = 'assets/images/mice6.png';
                                $data[5]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('Engineering',''),
                                            array('Human Resource',''),
                                            array('Management',''),
                                            array('Finance',''),
                                            array('Marketing',''),
                                            array('Economics',''),
                                            array('Team Building',''),
                                            array('Meeting Professional',''),
                                            array('Incentive Specialist',''),
                                            array('Conference Professional',''),
                                            array('Exhibition Professional',''),
                                            array('Venue Management Professional',''),
                                            array('MICE Coach',''),
                                            array('Train the Trainers',''),
                                            array('Sustainable Event Professional',''),
                                            array('Presentation Skills',''),
                                            array('Social Medias',''),
                                            array('International',''),
                                            array('Communication Skills',''),
                                            array('Management Skills',''),
                                            array('Strategic Focus',''),
                                            array('Sales & Business Development',''),
                                            array('General',''),
                                        )
                                    )
                                );

                                $data[6] = array();
                                $data[6]['name'] = 'ขายปลีก/แหล่งช้อปปิ้ง';
                                $data[6]['img'] = 'assets/images/mice7.png';
                                $data[6]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('ห้างสรรพสินค้า ร้านค้าปลีกขนาดใหญ่','ห้างสรรพสินค้า ร้านค้าปลีกขนาดใหญ่ ที่มีการตกแต่งร้านเน้นความสวยงามและมีพนักงานบริการให้คำแนะนำ'),
                                            array('ร้านค้าปลีก','ร้านค้าปลีกที่มุ่งเน้นขายสินค้าที่มีความหลากหลายในราคาประหยัดกว่าห้างสรรพสินค้า'),
                                            array('ตลาด','สถานที่จำหน่ายสินค้าและของใช้ในชีวิตประจำวัน ทั้งอาหารสดและอาหารสำเร็จรูป'),
                                            array('ร้านขายสินค้าเฉพาะอย่าง','ร้านขายสินค้าเฉพาะอย่าง โดยส่วนมากจะเป็นการขายสินค้าเฉพาะด้านที่มีความเฉพาะเจาะจงด้านคุณภาพ และบางร้านอาจจะขายสินค้าเฉพาะยี่ห้อของตนเอง'),
                                            array('ร้านค้าสินค้าหนึ่งตำบล หนึ่งผลิตภัณฑ์','ร้านค้าสินค้าหนึ่งตำบล หนึ่งผลิตภัณฑ์ ร้านค้าที่ขายของที่ระลึกของฝากที่เป็นของท้องถิ่นโดยเฉพาะ')
                                        )
                                    )
                                );

                                $data[7] = array();
                                $data[7]['name'] = 'โชว์/การแสดง';
                                $data[7]['img'] = 'assets/images/mice8.png';
                                $data[7]['checkbox'] = array();

                                $data[8] = array();
                                $data[8]['name'] = 'อาหารและเครื่องดื่ม';
                                $data[8]['img'] = 'assets/images/mice9.png';
                                $data[8]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('บริการอาหารและเครื่องดื่ม', 'กลุ่มธุรกิจบริการอาหารและเครื่องดื่ม ครอบคลุมถึงธุรกิจให้บริการอาหารและเครื่องดื่มที่เป็นส่วนหนึ่งของกิจกรรมไมซ์ ไม่ว่าจะเป็นธุรกิจบริการอาหารและเครื่องดื่มโดยเฉพาะ หรือธุรกิจร้านอาหารและเครื่องดื่มที่เป็นส่วนหนึ่งของโรงแรมที่จัดงาน'),
                                            array('ร้านอาหารและภัตตาคารขนาดใหญ่','ร้านอาหารและภัตตาคารขนาดใหญ่ที่สามารถรองรับนักท่องเที่ยวกลุ่มไมซ์'),
                                            array('ซุ้มอาหารและรถอาหารเคลื่อน','ธุรกิจซุ้มอาหารและรถอาหารเคลื่อนที่ ที่สามารถรองรับการจัดกิจกรรมไมซ์'),
                                            array('บริการเครื่องดื่ม','ธุรกิจให้บริการเครื่องดื่มที่สามารถรองรับในการจัดกิจกรรมไมซ์ ซึ่งสามารถแบ่งประเภทกลุ่มย่อยตามพฤติกรรมการให้บริการ ดังนี้ การให้บริการชาและกาแฟ การให้บริการเครื่องดื่มที่ไม่มีแอลกอฮอล์ และเครื่องดื่มแอลกอฮอล์'),
                                            array('บริการจัดเลี้ยง','ธุรกิจการให้บริการจัดเลี้ยงที่สามารถรองรับในการจัดกิจกรรมไมซ์ ซึ่งสามารถแบ่งประเภทกลุ่มย่อยตามพฤติกรรมการให้บริการ ดังนี้ การให้บริการ อาหารว่าง การให้บริการอาหารกล่อง การให้บริการอาหารแบบบุฟเฟ่ต์ การให้บริการอาหารแบบโต๊ะจีน และการให้บริการแบบค็อกเทล')
                                        )
                                    )
                                );

                                $data[9] = array();
                                $data[9]['name'] = 'ธุรกิจบริการอื่นๆ';
                                $data[9]['img'] = 'assets/images/mice10.png';
                                $data[9]['checkbox'] = array(
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-บริการด้านการพยาบาล',
                                        'subgroup' => array(
                                            array('รักษาพยาบาล','การให้บริการด้านการรักษาพยาบาล'),
                                            array('ดูแลผู้ป่วย','การให้บริการด้านการดูแลผู้ป่วย')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-บริการด้านการสื่อสารกระจายข่าว',
                                        'subgroup' => array(
                                            array('โทรทัศน์','ธุรกิจผู้ให้บริการด้านการสื่อสารทางโทรทัศน์'),
                                            array('วิทยุ','ธุรกิจผู้ให้บริการด้านการสื่อสารทางวิทยุ'),
                                            array('อินเทอร์เน็ต','ธุรกิจผู้ให้บริการด้านการสื่อสารทางอินเทอร์เน็ต')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-สื่อสิ่งพิมพ์',
                                        'subgroup' => array(
                                            array('หนังสือพิมพ์ท้องถิ่น','ธุรกิจผู้ให้บริการหนังสือพิมพ์ท้องถิ่น'),
                                            array('หนังสือพิมพ์ระดับประเทศ','ธุรกิจผู้ให้บริการหนังสือพิมพ์ระดับประเทศ'),
                                            array('นิตยสาร/วารสาร','ธุรกิจผู้ให้บริการนิตยสาร/วารสาร')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-โทรคมนาคม',
                                        'subgroup' => array(
                                            array('โทรคมนาคมแบบไร้สาย','ธุรกิจผู้ให้บริการด้านโทรคมนาคมแบบไร้สาย'),
                                            array('โทรคมนาคมแบบมีสาย','ธุรกิจผู้ให้บริการด้านโทรคมนาคมแบบมีสาย'),
                                            array('โทรคมนาคมแบบผ่านดาวเทียม','ธุรกิจผู้ให้บริการด้านโทรคมนาคมแบบผ่านดาวเทียม')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-บริการด้านการจัดการข้อมูล',
                                        'subgroup' => array(
                                            array('บริการด้านการจัดเก็บฐานข้อมูล และการวิเคราะห์ข้อมูล','ธุรกิจผู้ให้บริการข้อมูลด้านการจัดเก็บฐานข้อมูล และการวิเคราะห์ข้อมูล'),
                                            array('บริการด้านการเป็นศูนย์กลางรวมข้อมูล และข่าวสาร','ธุรกิจผู้ให้บริการด้านการเป็นศูนย์กลางรวมข้อมูล และข่าวสาร')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-สื่อดิจิตอล',
                                        'subgroup' => array(
                                            array('เกมส์และสื่อปฏิสัมพันธ์','ธุรกิจผู้ให้บริการด้านเกมส์และสื่อปฏิสัมพันธ์'),
                                            array('อนิเมชั่นและสื่อดิจิตอล','ธุรกิจผู้ให้บริการด้านอนิเมชั่นและสื่อดิจิตอล'),
                                            array('ออกแบบกราฟฟิค','ธุรกิจผู้ให้บริการด้านการออกแบบกราฟฟิค')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-บริการเกี่ยวกับการเงิน',
                                        'subgroup' => array(
                                            array('ธนาคาร','ธุรกิจผู้ให้บริการด้านธนาคาร'),
                                            array('ผู้ให้บริการด้านการเงินอื่นๆ','ธุรกิจผู้ให้บริการด้านการเงินอื่นๆ')
                                        )
                                    ),
                                    array(
                                        'group' => 'อุตสาหกรรมสนับสนุน-สำนักพิมพ์',
                                        'subgroup' => array(
                                            array('สำนักพิมพ์ทั่วไป','ธุรกิจผู้ให้บริการด้านสำนักพิมพ์ทั่วไป'),
                                            array('สำนักพิมพ์ประเภท E-book','ธุรกิจผู้ให้บริการด้านสำนักพิมพ์ประเภท E-book')
                                        )
                                    ),
                                );

                                $data[10] = array();
                                $data[10]['name'] = 'โลจิสติกส์';
                                $data[10]['img'] = 'assets/images/mice11.png';
                                $data[10]['checkbox'] = array(
                                    array(
                                        'group' => 'ระบบขนส่ง-ขนส่งสินค้า',
                                        'subgroup' => array(
                                            array('ขนส่งสินค้าระหว่างประเทศ', 'ธุรกิจที่ทำหน้าที่เป็นตัวกลางประสานบริการขนส่งสินค้าทางอากาศ ทางเรือ ทางรถยนต์ทั้งภายในประเทศ และระหว่างประเทศ'),
                                            array('ขนส่งระหว่างประเทศทางอากาศ','ธุรกิจผู้ให้บริการรับจัดการขนส่งสินค้าระหว่างประเทศ ซึ่งเน้นการให้บริการรับจัดการขนส่งสินค้าทางอากาศ'),
                                            array('ขนส่งระหว่างประเทศทางทะเล', 'ธุรกิจผู้ให้บริการรับจัดการขนส่งสินค้าระหว่างประเทศ ซึ่งเน้นการให้บริการรับจัดการขนส่งสินค้าทางทะเล'),
                                            array('บริการด้านพิธีการศุลกากร','ธุรกิจผู้ให้บริการด้านพิธีการศุลกากรและเป็นตัวแทนในการนำสินค้าออกจากด่าน รวมถึงการจัดเตรียมเอกสารและการให้คำแนะนำเกี่ยวกับสิทธิประโยชน์ทางภาษีในการนำเข้า-ส่งออก ธุรกิจนี้อาจเรียกชื่ออย่างว่าตัวแทนชิปปิ้ง'),
                                            array('ขนส่งสินค้าในประเทศ','ธุรกิจผู้ให้บริการขนส่งสินค้าภายในประเทศเพื่อเป็นการสนับสนุนธุรกิจให้บริการขนส่งสินค้าระหว่างประเทศ')
                                        )
                                    ),
                                    array(
                                        'group' => 'ระบบขนส่ง-ขนส่งผู้โดยสาร',
                                        'subgroup' => array(
                                            array('บริการด้านรถเช่าประเภทรถยนต์', 'ธุรกิจการให้บริการด้านรถเช่าประเภทรถยนต์'),
                                            array('บริการด้านรถโดยสาร','ธุรกิจการให้บริการด้านรถโดยสาร'),
                                            array('บริการด้านรถไฟ', 'ธุรกิจการให้บริการด้านรถไฟ'),
                                            array('บริการด้านเรือโดยสาร เรือสำราญ','ธุรกิจการให้บริการด้านเรือโดยสาร เรือสำราญ'),
                                            array('สายการบินทั้งในประเทศ และต่างประเทศ','ธุรกิจสายการบินทั้งในประเทศ และต่างประเทศ')
                                        )
                                    ),
                                    array(
                                        'group' => 'ระบบขนส่ง-ประกันที่เกี่ยวข้องกับระบบการขนส่ง',
                                        'subgroup' => array(
                                            array('ประกันการขนส่งสินค้า', 'ธุรกิจการให้บริการด้านประกันการขนส่งสินค้า'),
                                            array('ประกันผู้เดินทาง','ธุรกิจการให้บริการด้านการประกันผู้เดินทาง')
                                        )
                                    ),
                                    array(
                                        'group' => 'ระบบขนส่ง-คลังสินค้า รับฝากและจัดเก็บสินค้า',
                                        'subgroup' => array(
                                            array('คลังสินค้า รับฝากและจัดเก็บสินค้า', 'ธุรกิจการให้บริการด้านคลังสินค้า รับฝากและจัดเก็บสินค้า'),
                                            array('บรรจุสินค้า','ธุรกิจการให้บริการด้านบรรจุสินค้าตามความเหมาะสม')
                                        )
                                    )
                                );

                                $data[11] = array();
                                $data[11]['name'] = 'หน่วยงานที่เกี่ยวข้อง (ภาครัฐ/สมาคม)';
                                $data[11]['img'] = 'assets/images/mice12.png';
                                $data[11]['checkbox'] = array(
                                    array(
                                        'group' => '',
                                        'subgroup' => array(
                                            array('หน่วยงานส่งเสริมและสนับสนุนอุตสาหกรรมไมซ์','หน่วยงานที่เป็นองค์กรหลักที่มีหน้าที่ในการส่งเสริมและสนับสนุนอุตสาหกรรมไมซ์ของเมืองหรือของประเทศ'),
                                            array('หน่วยงานภาครัฐ','หน่วยงานภาครัฐที่เกี่ยวข้องทั้งส่วนกลางและส่วนท้องถิ่น'),
                                            array('สมาคม สภา','สมาคมที่เกี่ยวข้องกับอุตสาหกรรมไมซ์ทั้งในประเทศและต่างประเทศ'),
                                            array('สถาบันการศึกษา','สถาบันการศึกษาทั้งในระดับมหาวิทยาลัย และอาชีวะศึกษาที่เป็นของภาครัฐ และภาคเอกชน'),
                                            array('สถาบันทั้งภาครัฐ และเอกชนที่ไม่ใช่สถาบันการศึกษา',''),
                                            array('องค์กรหรือการรวมกลุ่มทางด้านอุตสาหกรรม','องค์กรหรือการรวมกลุ่มทางด้านอุตสาหกรรม เช่น สภาอุตสาหกรรมจังหวัด หอการค้าจังหวัดและสภาหอการค้าจังหวัด')
                                        )
                                    )
                                );
                            ?>
                            <div class="panel-body">
                                <div class="form-group">
                                    <label class="font-semibold font-18 mobile-font-16">
                                        <div class="text-icon is-middle icon-right mobile-has-info">
                                            <i class="m-icon m-icon-help" data-toggle="tooltip" data-placement="right" title="Information"></i>
                                            <span>ธุรกิจหลัก <br class="hidden-desktop" /><span class="mobile-font-regular">(สามารถเลือกได้เพียง 1 ตัวเลือกเท่านั้น)</span></span>
                                        </div>    
                                    </label>
                                    <div class="radio-box">
                                        <div class="row is-small2">
                                            <?php foreach($data as $key => $item) { ?>
                                            <div class="col col-sm-3 col-xs-6">
                                                <div class="checkbox">
                                                    <input type="radio" name="type" id="type<?= $key ?>" onchange="select_type(<?= $key ?>)">
                                                    <label for="type<?= $key ?>">
                                                        <div class="inner">
                                                            <img src="<?= $item['img'] ?>">
                                                            <div class="name"><?= $item['name'] ?></div>
                                                            <button type="button" class="btn-trans btn-info" data-toggle="tooltip" data-placement="left" title="Information"><i class="m-icon m-icon-info"></i></button>
                                                        </div>
                                                    </label>
                                                </div>
                                            </div>
                                            <?php } ?>
                                        </div>
                                    </div>
                                    <p class="required">กรุณาเลือกข้อมูล</p>
                                </div>

                                <?php foreach($data as $key => $type) { ?>
                                    <?php if(count($type['checkbox']) > 0) { ?>
                                        <div class="select-group" data-key="<?= $key ?>" style="display: none;" >
                                            <hr class="in-panel"/>
                                            <div class="form-group">
                                                <label class="font-semibold font-18 no-margin"><?= $type['name'] ?></label>
                                                <br/><br/>

                                                <?php foreach($type['checkbox'] as $key2 => $group) { ?>
                                                    <div class="row">

                                                        <?php if(count($group['group']) != '') { ?>
                                                            <div class="col-sm-12">
                                                                <p><b><u><?= $group['group'] ?></u></b></p>
                                                            </div>
                                                        <?php } ?>
                                                        
                                                        <?php foreach($group['subgroup'] as $key3 => $subgroup) { ?>
                                                            <div class="col-sm-6">
                                                                <div class="checkbox">
                                                                    <input type="checkbox" id="checkbox-<?= $key.$key2.$key3 ?>">
                                                                    <label for="checkbox-<?= $key.$key2.$key3 ?>">
                                                                        <p class="font-16 font-semibold no-margin"><?= $subgroup[0] ?></p>
                                                                        <p class="mobile-font-regular"><?= $subgroup[1] ?></p>
                                                                    </label>
                                                                </div>
                                                            </div>

                                                            <?php if($key3 % 2) { ?>
                                                                <div class="clearfix"></div>
                                                            <?php } ?> 

                                                        <?php } ?>   

                                                    </div>
                                                <?php } ?>

                                                <p class="required">กรุณาเลือกข้อมูล</p>
                                            </div>
                                        </div>
                                    <?php } ?>
                                <?php } ?>

                                <hr class="in-panel"/>
                                <div class="form-group">
                                    <label class="font-semibold font-18 mobile-font-16">
                                        <div class="text-icon is-middle icon-right mobile-has-info">
                                            <i class="m-icon m-icon-help" data-toggle="tooltip" data-placement="right" title="Information"></i>
                                            <span>บริการรองของธุรกิจ <br class="hidden-desktop" /><span class="font-regular">(เลือกได้สูงสุด 2 ตัวเลือก)</span></span>
                                        </div>
                                    </label>
                                    <div class="radio-box" id="second-type">
                                        <div class="row is-small2">
                                            <?php foreach($data as $key => $item) { ?>
                                            <div class="col col-sm-3 col-xs-6">
                                                <div class="checkbox">
                                                    <input type="checkbox" name="second-type" id="second-type<?= $key ?>" onchange="select_type_second(this)">
                                                    <label for="second-type<?= $key ?>">
                                                        <div class="inner">
                                                            <img src="<?= $item['img'] ?>">
                                                            <div class="name"><?= $item['name'] ?></div>
                                                            <button type="button" class="btn-trans btn-info" data-toggle="tooltip" data-placement="left" title="Information"><i class="m-icon m-icon-info"></i></button>
                                                        </div>
                                                    </label>
                                                </div>
                                            </div>
                                            <?php } ?>
                                        </div>
                                    </div>
                                    <p class="required">กรุณาเลือกข้อมูล</p>
                                </div>
                            </div>
                        </div>
                        <div class="panel panel-default mt25">
                            <div class="panel-body ">
                                <label class="font-semibold font-18 no-margin">เลขทะเบียนนิติบุคคล 13 หลัก (ถ้ามี)</label>
                                <br/><br/>
                                <div class="form-inline form-tax">
                                    <div class="form-group">
                                        <input type="text" data-mask="0-0000-00000-00-0" class="form-control" placeholder="เลขทะเบียนนิติบุคคล">
                                    </div>
                                    <div class="form-group">
                                        <button type="button" class="btn btn-md btn-blue-linear" onclick="search_tax_id()">Search</button>
                                    </div>
                                </div>
                                <div class="card-select" style="display: none">
                                    <div class="radio">
                                        <input type="radio" id="taxID1" onchange="select_tax(this)">
                                        <label for="taxID1">
                                            <p>วิลล่า โฮเต็ลแอนด์รีสอร์ท</p>
                                            <p class="no-margin">26/46 อาคารอรกานต์ ชั้น 12A ถ.ชิดลม แขวงลุมพินี เขตปทุมวัน กรุงเทพมหานคร 10330</p>
                                            <input type="hidden" name="card_name_th" value="วิลล่า โฮเต็ลแอนด์รีสอร์ท">
                                            <input type="hidden" name="card_name_en" value="Villa Hotel and Resort">
                                            <input type="hidden" name="card_company_th" value="วิลล่า โฮเต็ลแอนด์รีสอร์ท">
                                            <input type="hidden" name="card_company_en" value="Villa Hotel and Resort">
                                            <input type="hidden" name="card_tax_id" value="0105561094601">
                                            <input type="hidden" name="card_email" value="info@villahotelandresort.com">
                                            <input type="hidden" name="card_tel" value="080-000-0000">
                                        </label>
                                        <button type="button" class="btn btn-md btn-blue-linear btn-select">เลือก</button>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div class="panel panel-default mt25" id="tax_detail">
                            <div class="panel-heading">
                                <h3 class="font-semibold no-margin">ใส่ข้อมูลรายละเอียดธุรกิจ</h3>
                            </div>
                            <div class="panel-body ">
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">ชื่อสถานประกอบการ (ภาษาไทย)</label>
                                            <input type="text" class="form-control" name="name_th" id="name_th" placeholder="ชื่อสถานประกอบการ (ภาษาไทย)" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">ชื่อสถานประกอบการ (ภาษาอังกฤษ)</label>
                                            <input type="text" class="form-control" name="name_en" id="name_en" placeholder="ชื่อสถานประกอบการ (ภาษาอังกฤษ)" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold fullwidth">ชื่อองค์กรหรือบริษัท (ภาษาไทย) <div class="checkbox pull-right no-margin same-name"><input type="checkbox" id="same1"><label for="same1">ชื่อเดียวกับสถานประกอบการ</label></div></label>
                                            <input type="text" class="form-control" name="company_th" id="company_th" placeholder="ชื่อองค์กรหรือบริษัท (ภาษาไทย)" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold fullwidth">ชื่อองค์กรหรือบริษัท (ภาษาอังกฤษ) <div class="checkbox pull-right no-margin same-name"><input type="checkbox" id="same2"><label for="same2">ชื่อเดียวกับสถานประกอบการ</label></div></label>
                                            <input type="text" class="form-control" name="company_en" id="company_en" placeholder="ชื่อองค์กรหรือบริษัท (ภาษาอังกฤษ)" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold" >เลขทะเบียนนิติบุคคล 13 หลัก</label>
                                            <input type="text" class="form-control" name="tax_id" id="tax_id" placeholder="เลขทะเบียนนิติบุคคล 13 หลัก" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">อีเมลติดต่อหลัก (ธุรกิจ)</label>
                                            <input type="text" class="form-control" name="email" id="email" placeholder="อีเมลติดต่อหลัก (ธุรกิจ)" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">เบอร์โทรศัพท์</label>
                                            <input type="text" class="form-control" name="tel" id="tel" placeholder="เบอร์โทรศัพท์" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold fullwidth">มาตรฐานที่ได้รับ</label>
                                            <div class="checkbox is-inline is-middle">
                                                <input type="checkbox" id="standard1">
                                                <label for="standard1">
                                                    TMVS <img src="assets/images/standard1.png">
                                                </label>
                                            </div>
                                            <div class="checkbox is-inline is-middle">
                                                <input type="checkbox" id="standard2">
                                                <label for="standard2">
                                                    AMVS <img src="assets/images/standard2.png">
                                                </label>
                                            </div>
                                            <p class="required">กรุณาเลือกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-12">
                                        <div class="form-group">
                                            <label class="font-semibold fullwidth">อัพโหลดเอกสารยืนยันมาตรฐานที่ได้รับหรือใบอนุญาตประกอบธุรกิจสำหรับ <span class="font-blue">สถานที่จัดงาน</span> <span class="font-regular">(สามารถอัพโหลดสูงสุดได้ 5 ไฟล์)</span></label> 
                                            <div class="upload-file">
                                                <div class="input">
                                                    <input type="file" accept=".pdf" multiple maxlength="5" maxsize="25">
                                                    <button type="button" class="btn btn-sm btn-orange">อัพโหลด์ไฟล์</button>
                                                    <p class="no-margin">PDF Max file : 25 MB</p>
                                                </div>
                                                <div class="text">
                                                    <div class="inner">
                                                        <span>เอกสารยืนยัน TMVS.pdf</span>
                                                        <i class="m-icon m-icon-close remove-file"></i>
                                                    </div>
                                                    <div class="inner">
                                                        <span>เอกสารยืนยัน AMVS.pdf</span>
                                                        <i class="m-icon m-icon-close remove-file"></i>
                                                    </div>
                                                </div>
                                            </div>
                                            <p class="required">กรุณาอัพโหลดไฟล์</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-12">
                                        <div class="form-group">
                                            <label class="font-semibold fullwidth">อัพโหลดเอกสารประกอบอื่นๆ <span class="font-regular">(สามารถอัพโหลดสูงสุดได้ 5 ไฟล์)</span></label> 
                                            <div class="upload-file">
                                                <div class="input">
                                                    <input type="file" accept=".pdf" multiple maxlength="5" maxsize="25">
                                                    <button type="button" class="btn btn-sm btn-orange">อัพโหลด์ไฟล์</button>
                                                    <p class="no-margin">PDF Max file : 25 MB</p>
                                                </div>
                                                <div class="text">
                                                    
                                                </div>
                                            </div>
                                            <p class="required">กรุณาอัพโหลดไฟล์</p>
                                        </div>
                                    </div>
                                </div>
                                <hr class="in-panel"/>
                                <div class="row">
                                    <div class="col-sm-12">
                                        <div class="form-group">
                                            <label class="font-semibold">ที่อยู่</label>
                                            <p>ใช้เพื่อเป็นข้อมูลแสดงผลในหน้าเว็บไซต์และเพื่อประเมินระยะเวลาในการเดินทางและช่วยแนะนำเส้นทางแก่ลูกค้าในอนาคต</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">ที่อยู่สถานประกอบการ (ภาษาไทย)</label>
                                            <input type="text" class="form-control" placeholder="เลขที่/อาคาร/ซอย">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">ที่อยู่สถานประกอบการ (ภาษาอังกฤษ)</label>
                                            <input type="text" class="form-control" placeholder="Unit/Building/Valley">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">รหัสไปรษณีย์</label>
                                            <input type="text" class="form-control" placeholder="รหัสไปรษณีย์">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">จังหวัด</label>
                                            <div class="select fullwidth">
                                                <select class="form-control">
                                                    <option value="">เลือกจังหวัด</option>
                                                    <option value="">จังหวัด 1</option>
                                                    <option value="">จังหวัด 2</option>
                                                    <option value="">จังหวัด 3</option>
                                                </select>
                                                <span class="m-icon m-icon-dropdown"></span>
                                            </div>
                                            <p class="required">กรุณาเลือกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">เขต/อำเภอ</label>
                                            <div class="select fullwidth">
                                                <select class="form-control">
                                                    <option value="">เลือกเขต/อำเภอ</option>
                                                    <option value="">อำเภอ 1</option>
                                                    <option value="">อำเภอ 2</option>
                                                    <option value="">อำเภอ 3</option>
                                                </select>
                                                <span class="m-icon m-icon-dropdown"></span>
                                            </div>
                                            <p class="required">กรุณาเลือกข้อมูล</p>
                                        </div>  
                                    </div>
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">แขวง/ตำบล</label>
                                            <div class="select fullwidth">
                                                <select class="form-control">
                                                    <option value="">เลือกแขวง/ตำบล</option>
                                                    <option value="">ตำบล 1</option>
                                                    <option value="">ตำบล 2</option>
                                                    <option value="">ตำบล 3</option>
                                                </select>
                                                <span class="m-icon m-icon-dropdown"></span>
                                            </div>
                                            <p class="required">กรุณาเลือกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-6">
                                        <div class="form-group">
                                            <label class="font-semibold">ระยะทางที่อยู่</label>
                                            <input type="text" class="form-control" placeholder="เช่น 100 เมตร ใกล้รถไฟฟ้า BTS นานา, ร้านติดริมถนน">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                                <div class="row">
                                    <div class="col-sm-12">
                                        <div class="form-group">
                                            <label class="font-semibold">ยืนยันตำแหน่งของสถานประกอบการ</label>
                                            <div class="select-map">
                                                <button type="button" onclick="get_location();" class="btn btn-sm btn-blue font-semibold">เลือกจากพิกัด Google Map</button>
                                                <input id="pac-input" type="hidden">
                                                <div class="map-box">
                                                    <div id="map"></div>
                                                </div>
                                            </div>
                                            <p class="required">กรุณาระบุพิกัด</p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div class="panel panel-default mt25">
                            <div class="panel-heading">
                                <h3 class="font-semibold no-margin">คำบรรยายเชิงธุรกิจของสถานประกอบการ</h3>
                            </div>
                            <div class="panel-body">
                                <div class="row">
                                    <div class="col-md-9">
                                        <div class="form-group">
                                            <label class="font-semibold fullwidth">คำที่ช่วยในการค้นหา Keyword</label>
                                            <input type="text" data-role="tagsinput" class="form-control" placeholder="Keyword">
                                            <p><small>สามารถใส่ Keyword ได้สูงสุด 20 คำ</small></p>
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                        <div class="form-group">
                                            <label  >คำอธิบายเพิ่มเติม (ภาษาไทย)</label>
                                            <div class="limit-char">
                                                <textarea class="form-control" rows="3" placeholder="คำอธิบายเพิ่มเติม (ภาษาไทย)" maxlength="600"></textarea>
                                                <div class="char"><span class="cnt">0</span>/600</div>
                                            </div>
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                        <div class="form-group">
                                            <label class="font-semibold">คำอธิบายเพิ่มเติม (ภาษาอังกฤษ)</label>
                                            <div class="limit-char">
                                                <textarea class="form-control" rows="3" placeholder="คำอธิบายเพิ่มเติม (ภาษาอังกฤษ)" maxlength="600"></textarea>
                                                <div class="char"><span class="cnt">0</span>/600</div>
                                            </div>
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                        <div class="form-group">
                                            <label class="font-semibold">องค์กรที่ธุรกิจสังกัดอยู่</label>
                                            <input type="text" class="form-control" placeholder="องค์กรที่ธุรกิจสังกัดอยู่" value="">
                                            <p class="required">กรุณากรอกข้อมูล</p>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div class="panel panel-default mt25">
                            <div class="panel-heading">
                                <h3 class="font-semibold no-margin">อัพโหลดรูปภาพสำหรับแสดงในหน้าค้นหารายการ</h3>
                            </div>
                            <div class="panel-body">
                                <div class="row is-small2">
                                    <div class="col col-sm-3 col-xs-12">
                                        <div class="upload-photo">
                                            <!-- <div class="preview" style="background-image: url('assets/images/ex-img.png')"></div> -->
                                            <div class="input">
                                                <input type="file" accept="image/*">
                                                <div class="text">
                                                    <div class="text-icon">
                                                        <i class="m-icon m-icon-plus"></i>
                                                        <p>อัพโหลดรูปภาพ</p>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                        <p>ขนาดที่แนะนำ :<br/>500 x 550 px ไม่เกิน 3 MB</p>
                                    </div>
                                    <div class="col col-sm-9">
                                        <p class="font-semibold no-margin">ตัวอย่าง</p>
                                        <p>ตำแหน่งการแสดงรูปภาพสำหรับในหน้าค้นหารายการ</p>
                                        <img src="assets/images/ex.png" class="img-responsive hidden-mobile">
                                        <img src="assets/images/ex-mobile.png" class="img-responsive hidden-desktop">
                                    </div>
                                </div>
                            </div>
                        </div>
                    </form>
                    <div class="to-top">
                        <div class="inner">
                            <span class="glyphicon glyphicon-menu-up"></span>
                            <p>กลับขึ้น<br/>ด้านบน</p>
                        </div>
                    </div>
                </div>
            </section>
        </div>
        <?php include "layout/footer.php" ?>
        <script defer src="https://maps.googleapis.com/maps/api/js?key=AIzaSyABK4plFcFDYfEr1XhsMZ89bkloa182UrQ&callback=initMap&libraries=places"></script>
        <style>
            .gm-style .gm-style-iw-d{
                overflow: hidden !important;
            }
            .gm-style .gm-style-iw {
                background: #fbad26 !important;
                font-family: 'Kanit';
                font-weight: 600;
                font-size: 12px;
                line-height: 15px;
                color: #fff;
                padding: 10px !important;
                width: 120px;
                max-width: 80%;
                text-align: center;
            }
            .gm-style-iw button, .gm-style .gm-style-iw-t::after {
                display: none !important;
            }

            @media (max-width: 767px){
                .gmnoprint, .gm-fullscreen-control{
                    zoom: 0.45;
                }
            }
        </style>
        <script>
            var input = document.getElementById('pac-input');
            var map, marker, infowindow, searchBox;
            function initMap()
            {
                if (navigator.geolocation) {
                    navigator.geolocation.getCurrentPosition(function(position) {
                        var pos = {
                            lat: position.coords.latitude,
                            lng: position.coords.longitude
                        };  

                        map = new google.maps.Map(document.getElementById('map'), {
                            center: pos,
                            zoom: 16
                        });
                        
                        marker = new google.maps.Marker({
                            position: pos,
                            icon: 'assets/images/mark-orange.png',
                            map: map,
                            draggable: true,
                        });

                        infowindow = new google.maps.InfoWindow({
                            content: 'Your Location'
                        });
                        infowindow.open(map, marker);

                        searchBox = new google.maps.places.SearchBox(input);
                        google.maps.event.addListener(map, 'bounds_changed', function() 
                        {
                            searchBox.setBounds(map.getBounds());
                        }); 
                        google.maps.event.addListener(searchBox, 'places_changed', function() 
                        {
                            var places = searchBox.getPlaces();
                            if (places.length == 0) {
                                return;
                            }
                            var bounds = new google.maps.LatLngBounds();
                            places.forEach(function(place) {
                                if (!place.geometry) {
                                    console.log("Returned place contains no geometry");
                                    return;
                                }

                                marker.setPosition(place.geometry.location);
                                console.log(place.geometry.location);

                                if (place.geometry.viewport) {
                                    bounds.union(place.geometry.viewport);
                                } else {
                                    bounds.extend(place.geometry.location);
                                }
                            });
                            map.fitBounds(bounds);
                        }); 
                        // end event 
                       
                    }, function() {
                        alert('not point location current');
                    });
                } 
                else
                {
                    alert('open location');
                }
            }

            function get_location()
            {
                var name = $('#b-name-th').val();
                var province = $('#b-province').val();
                var district = $('#b-district').val();
                var sub_district = $('#b-sub-district').val();
                var postcode = $('#b-postcode').val();
                $(input).val('เซนทรัลพระราม 9');
                // $(input).val(name+' '+sub_district+' '+district+' '+province+' '+postcode);
                google.maps.event.trigger(input, 'focus', {});
                google.maps.event.trigger(input, 'keydown', { keyCode: 13 });
                google.maps.event.trigger(this, 'focus', {});
            }

            function search_tax_id()
            {
                $('.card-select').fadeIn(300);
            }

            function select_tax(e)
            {
                var parent = $(e).parent();
                $('#name_th').val(parent.find('input[name="card_name_th"]').val());
                $('#name_en').val(parent.find('input[name="card_name_en"]').val());
                $('#company_th').val(parent.find('input[name="card_company_th"]').val());
                $('#company_en').val(parent.find('input[name="card_company_en"]').val());
                $('#tax_id').val(parent.find('input[name="card_tax_id"]').val());
                $('#email').val(parent.find('input[name="card_email"]').val());
                $('#tel').val(parent.find('input[name="card_tel"]').val());
            }

            function select_type(key)
            {
                $('.select-group').hide();
                $('.select-group[data-key="'+key+'"]').show();

                $('#second-type input').prop('disabled', false);
                $('#second-type'+key).prop('disabled', true);
                $('#second-type'+key).prop('checked', false);
            }

            function select_type_second(ele)
            {
                if($('#second-type input:checked').length > 2)
                {
                    $(ele).prop('checked', false);
                }
            }

            function set_footer()
            {
                var addition = ($(window).width() < 768) ? 50 : ($(window).width() < 991) ? 500 : 280;
                var footer = $('header').height() + ($('footer').height() + addition);
                $(window).scroll(function() {    
                    var body = $('#wrapper').height();           
                    var scroll = $(window).scrollTop(); 
                    var bottom = body - footer;
                    if (scroll >= bottom) {           
                        $('.step-footer').css({        
                            bottom: scroll - bottom
                        });
                    } else {     
                        $('.step-footer').attr('style', '');  
                    }
                });
            }

            (function(){

                // init
                $('#type0').prop('checked', true);
                select_type(0);

                $('.card-select .btn-select').click(function(){
                    $(this).parent().find('input').prop('checked', true);
                    $(this).parent().find('input').trigger('change');
                });

                $('form input').keydown(function(e){
                    if(e.keyCode == 13)
                    {
                        return false;
                    }
                });

                set_footer();

                $(window).resize(function(){
                    set_footer();
                });
                
            })();
        </script>
    </body>
</html>